colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
/*
 * CC1101.c
 *
 *  Created on: Feb 5, 2024
 *      Author: Collin Moore
 */

#include "cc1101.h"

#include "_4digit7seg.h"

#include "ev1527SPI.h" // For Async TX

#include "globalInts.h" // To set machine state

#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "pollers.h"
#include "spi0.h"

#include <stdlib.h>

#include "uptimeCounter.h"
#include "version.h"

#define NRF_LOG_MODULE_NAME CC1101
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

/*************************************************************************************
 *  Definitions
 ************************************************************************************/

#define UART_PRINTS 1

#if UART_PRINTS
#include "uartTerminal.h"
#include <stdio.h> // for snprintf
#endif // #if UART_PRINTS

// Chip status byte comes back on every SPI transaction's first byte
// b7 clear if ready
#define CHIPSTATUSBYTE_STATE(x)    ((x>>4)&0x07) // b6:4 state[2:0]
// In h file for users to poll.
#define CHIPSTATUSBYTE_FIFOBYTES_AVAIL(x) (x&0x0F) // b3:0 bytes available

// Configuration Registers
#define IOCFG2_REGADDR          0x00        // GDO2 output pin configuration
// b7 not used, reads 0
#define IOCFG2_GDO2_INV         0x40 // b6 inverts the GDO output, to active low, if set.
// b65:0 are GDO2_CFG, see macro below, which is the same for all 3 pins.
// Note that the default is CHP_RDYn on GDO2

#define IOCFG1_REGADDR          0x01        // GDO1 output pin configuration
#define IOCFG1_GDO_HIGHDRIVE    0x80 // b7 sets drive strength of all GDO pins, high if set. Default low, zero
#define IOCFG1_GDO1_INV         0x40  // b6 inverts the GDO output, to active low, if set.
// b65:0 are GDO1_CFG, see macro below, which is the same for all 3 pins.
// Note that the default is 3-state (hi-z) on GDO1

#define IOCFG0_REGADDR          0x02        // GDO0 output pin configuration
// b7 enables analog temp sensor. Must write all other bits in IOCFG to 0 to use temp sensor.
#define IOCFG0_TEMP_SENSOR_ENABLE   0x80
#define IOCFG0_GDO0_INV         0x40 // b6 inverts the GDO output, to active low, if set.
// b65:0 are GDO1_CFG, see macro below, which is the same for all 3 pins.
// Note that the default is clk_xosc/192 on GDO0. NOTE: disable this in RX

#define IOCFGx_GDOx_CFG(x)      (x&0x3F) // See table 41 on datasheet for functions
typedef enum
{
    gdox_rxfifoThreshold = 0,
    gdox_rxThresholdOrEndOfPkt,
    gdox_txFifoThreshold,
    gdox_txFifoFull,
    gdox_rxFifoOverflow,
    gdox_txFifoUnderflow,
    gdox_syncwordToEndOfPkt,
    gdox_rxPktCRCok,
    gdox_preambleQualityReached,
    gdox_channelIsClear,
    gdox_lockDetectorOutput,
    gdox_serialClock,
    gdox_syncSerialDataOutput,
    gdox_asyncSerialDataOutput,
    gdox_carrierSense,
    gdox_CRC_OK,
    gdox_rsvd1, // 16 to 21 reserved
    gdox_rsvd2,
    gdox_rsvd3,
    gdox_rsvd4,
    gdox_rsvd5,
    gdox_rsvd6,
    gdox_rx_hard_data_1,
    gdox_rx_hard_data_0,
    gdox_rsvd7,
    gdox_rsvd8,
    gdox_rsvd9, // 24 to 26 reserved
    gdox_PA_PD,
    gdox_LNA_PD,
    gdox_RX_SYMBOL_TICK,
    gdox_rsvd10, // 30 to 35 reserved
    gdox_rsvd11,
    gdox_rsvd12,
    gdox_rsvd13,
    gdox_rsvd14,
    gdox_rsvd15,
    gdox_WOR_EVT0,
    gdox_WOR_EVT1,
    gdox_CLK_256,
    gdox_CLK_32K,
    gdox_rsvd16,
    gdox_CHIP_RDYn,
    gdox_rsvd17,
    gdox_XOSC_STABLE,
    gdox_rsvd18,
    gdox_rsvd19,
    gdox_3state, // high-impedance
    gdox_HW_to_0, // to control an external LNA/PA or switch
    gdox_clk_xoscDiv1, // Note: Only one GDO pin can use any of these clk_xosc functions at a time.
    gdox_clk_xoscDiv1_5, // Also note: Please disable these oscillator functions when running RX or TX
    gdox_clk_xoscDiv2,
    gdox_clk_xoscDiv3,
    gdox_clk_xoscDiv4,
    gdox_clk_xoscDiv6,
    gdox_clk_xoscDiv8,
    gdox_clk_xoscDiv12,
    gdox_clk_xoscDiv16,
    gdox_clk_xoscDiv24,
    gdox_clk_xoscDiv32,
    gdox_clk_xoscDiv48,
    gdox_clk_xoscDiv64,
    gdox_clk_xoscDiv96,
    gdox_clk_xoscDiv128,
    gdox_clk_xoscDiv192
} iocfgx_gdox_cfg_t;

#define FIFOTHR_REGADDR         0x03        // RX FIFO and TX FIFO thresholds
// b7 unused, reads 0
#define FIFOTHR_ADC_RETENTION   0x40 // b6 ADC retention, see datasheet
#define FIFOTHR_CLOSE_IN_RX(x)  ((x<<4)&0x30)// b5:4 See DesignNote DN010, attenuation values
typedef enum
{
    closeInRx_0dB = 0,
    closeInRx_6dB,
    closeInRx_12dB,
    closeInRx_18dB
} fifothr_closeInRx_t;
#define FIFOTHR_FIFO_THR(x)     (x&0x07) // b3:0 are the threshold for RX and TX FIFO, exceeded when num bytes => threshold

#define SYNC1_REGADDR           0x04            // Sync word, high byte
// b7:0 are MSByte of 16-bit sync word
#define SYNC0_REGADDR           0x05            // Sync word, low byte
// b7:0 are LSByte of 16-bit sync word

#define PKTLEN_REGADDR          0x06            // Packet length, default 0xFF, don't write 0
// b7:0 indicate packet length in fixed packet length, max length in variable packet length mode

#define PKTCTRL1_REGADDR        0x07            // Packet automation control[1]
#define PKTCTRL1_PQT(x)         ((x<<5)&0xE0)   // b7:5 PQT[2:0]. 0 accepts all
// b4 unused, reads 0
#define PKTCTRL1_CRC_AUTOFLUSH  0x08 // b3 set: flushes RX FIFO if CRC not OK.
#define PKTCTRL1_APPEND_STATUS  0x04 // b2 set: Appends two status bytes onto the payload in RX
#define PKTCTRL1_ADDR_CHK(x)    (x&0x03) // b1:0 addr_chk mode
typedef enum
{
    addrChk_none = 0,
    addrChk_checkNoBroadcast,
    addrChk_checkAndZero,
    addrChk_checkAndZeroAndFF,
} pktCtrl1_addrChk_t;

#define PKTCTRL0_REGADDR        0x08            // Packet automation control[0]
// b7 unused, reads 0
#define PKTCTRL0_WHITE_DATA     0x40            // b6 set to turn data whitening on
// Commenting the below to get confused with fixed vs variable length packets
#define PKTCTRL0_PKT_FORMAT_WRITE(x)  ((x<<4)&0x30)   // b5:4
#define PKTCTRL0_PKT_FORMAT_READ(x)  ((pktCtrl0_pktFmt_t)((x>>4)&0x03))   // b5:4 shift down to 1:0
typedef enum
{
    pktCtrl0Format_normal = 0,
    pktCtrl0Format_syncSerial,
    pktCtrl0Format_randomTX,
    pktCtrl0Format_asyncSerial
} pktCtrl0_pktFmt_t;
