colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
#define WOREVT1_REGADDR         0x1E        // High byte Event 0 timeout
#define WOREVT0_REGADDR         0x1F        // Low byte Event 0 timeout

#define WORCTRL_REGADDR         0x20        // Wake On Radio control

#define FREND1_REGADDR          0x21        // Front end RX configuration

#define FREND0_REGADDR          0x22        // Front end TX configuration

#define FSCAL3_REGADDR          0x23        // Frequency synthesizer calibration

#define FSCAL2_REGADDR          0x24        // Frequency synthesizer calibration

#define FSCAL1_REGADDR          0x25        // Frequency synthesizer calibration

#define FSCAL0_REGADDR          0x26        // Frequency synthesizer calibration

#define RCCTRL1_REGADDR         0x27        // RC oscillator configuration

#define RCCTRL0_REGADDR         0x28        // RC oscillator configuration

#define FSTEST_REGADDR          0x29        // Frequency synthesizer cal control

#define PTEST_REGADDR           0x2A        // Production test

#define AGCTEST_REGADDR         0x2B        // AGC test

#define TEST2_REGADDR           0x2C        // Various test settings
#define TEST1_REGADDR           0x2D        // Various test settings
#define TEST0_REGADDR           0x2E        // Various test settings

// Strobe commands
#define STROBE_SRES         0x30        // Reset chip.
#define STROBE_SFSTXON      0x31        // Enable/calibrate freq synthesizer
#define STROBE_SXOFF        0x32        // Turn off crystal oscillator.
#define STROBE_SCAL         0x33        // Calibrate freq synthesizer & disable
#define STROBE_SRX          0x34        // Enable RX.
#define STROBE_STX          0x35        // Enable TX.
#define STROBE_SIDLE        0x36        // Exit RX / TX
//#define STROBE_SAFC       0x37        // AFC adjustment of freq synthesizer
#define STROBE_STARTWOR     0x38        // Start automatic RX polling sequence (Wake on Radio)
#define STROBE_POWERDOWN    0x39        // Enter pwr down mode when CSn goes hi
#define STROBE_FLUSHRXFIFO  0x3A        // Flush the RX FIFO buffer. Can only do this in IDLE or RXOVF states
#define STROBE_FLUSHTXFIFO  0x3B        // Flush the TX FIFO buffer. Can only do this in IDLE or TXUVF states
#define STROBE_RESETRTC     0x3C        // Reset real time clock to event1 value
#define STROBE_NOP          0x3D        // No operation.

// Other memory locations
#define PATABLE_REGADDR      0x3E // Must read or write PATABLE bytes 0:7 in burst read or write
#define TXFIFO_REGADDR       0x3F // Access in burst to read multiple bytes
#define RXFIFO_REGADDR       0x3F // Access in burst to read multiple bytes

// Status registers (need burst mode set)
#define PARTNUM_REGADDR         0xF0        // b7:0 should be 0x00 for part number
#define VERSION_REGADDR         0xF1        // b7:0 are 0x14 maybe, Current version number
#define FREQEST_REGADDR         0xF2        // Frequency offset estimate

#define LQI_REGADDR             0xF3        // Demodulator estimate for link quality
#define LQI_CRC_OK          0x80 // b7 set if last CRC comparison matched.
#define LQI_LQI_EST(x)      (x&0x7F) // b6:0 link quality indicator calculated over first 64 packet bytes

#define RSSI_REGADDR            0xF4        // b7:0 are Received signal strength indication
#define MARCSTATE_REGADDR       0xF5        // Main Radio Control state machine state
// b7:5 not used, read 0
typedef enum
{
    marcState_sleep = 0,
    marcState_idle,
    marcState_xoff,
    marcState_vcoon_mc,
    marcState_regon_mc,
    marcState_mancal,
    marcState_VCOon,
    marcState_regon,
    marcState_startcal,
    marcState_bwboost,
    marcState_fs_lock,
    marcState_ifadcon,
    marcState_endcal,
    marcState_rx,
    marcState_rx_end,
    marcState_rx_rst,
    marcState_txrx_switch,
    marcState_rxfifo_overflow,
    marcState_fstxon,
    marcState_tx,
    marcState_tx_end,
    marcState_rxtx_switch,
    marcState_txfifo_underflow
} marcState_state_t;

#define WORTIME1_REGADDR        0xF6        // High byte of WOR timer
#define WORTIME0_REGADDR        0xF7        // Low byte of WOR timer

#define PKTSTATUS_REGADDR       0xF8        // Current GDOx status and packet status
#define PKTSTATUS_CRC_OK        0x80 // b7 set if last CRC matched
#define PKTSTATUS_CS            0x40 // b6 Carrier sense. Cleared when entering idle
#define PKTSTATUS_PQT_REACHED   0x20 // b5 set if Preamble Quality is reached.
#define PKTSTATUS_CCA           0x10 // b4 set if channel is clear
#define PKTSTATUS_SFD           0x08 // b3 set start of Frame Delimiter, sync word has been received
#define PKTSTATUS_GDO2          0x04 // b2 set if GDO2 is active (non-inverted)
// b1 not used, reads 0
#define PKTSTATUS_GDO0          0x01 // b0 set if GDO2 is active (non-inverted)

#define VCO_VC_DAC_REGADDR      0xF9        // Test only: Current setting from PLL cal module

#define TXBYTES_REGADDR         0xFA        // Underflow and # of bytes in TXFIFO
#define TXBYTES_UNDERFLOW   0x80 // b7 set if underflow in TX register
#define TXBYTES_NUM(x)      (x&0x7F) // b6:0 num bytes in TX FIFO

#define RXBYTES_REGADDR         0xFB        // Overflow and # of bytes in RXFIFO
#define RXBYTES_OVERFLOW    0x80 // b7 set if RXoverflowed FIFO
#define RXBYTES_NUM(x)      (x&0x7F) // b6:0 num bytes in RX FIFO

#define RCCTRL1_STATUS_REGADDR  0xFC    // RC oscillator cal routine result.
#define RCCTRL0_STATUS_REGADDR  0xFD    // RC oscillator cal routine result.

// Masks for appended status bytes
#define CC1101_RSSI_RX        0x00        // Position of LQI byte
#define CC1101_LQI_RX         0x01        // Position of LQI byte
#define CC1101_CRC_OK         0x80        // Mask "CRC_OK" bit within LQI byte
#define CC1101_NUM_RXBYTES    0x7F        // Mask "# of bytes" field in _RXBYTES
#define CC1101_MARCSTATE_IDLE 0x01        // The status register indicates idle

// Definitions to support burst/single access:
#define CC1101_WRITE_BURST  0x40
#define CC1101_READ_SINGLE  0x80
#define CC1101_READ_BURST   0xC0

#define TX_TEST_ITVL_MS  0 // non-zero to run TX test poll

