colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
    // Read partNum and version registers
    ret = cc1101_readSingleByte(PARTNUM_REGADDR, &partNum);
    if (ret != true)
    {
        NRF_LOG_ERROR("Error reading PARTNUM");
        return false;
    }
    // CC1101 datasheet says partnum should be 0
    if (0 != partNum)
    {
        NRF_LOG_ERROR("Partnum is %d, expected 0", partNum);
        return false;
    }
    ret = cc1101_readSingleByte(VERSION_REGADDR, &version);
    if (ret != true)
    {
        NRF_LOG_ERROR("Error reading VERSION");
        return ret;
    }
    // Versions in the past have been 20 and 4. Datasheet says subject to change without notice.
    if (0 == version)
    {
        NRF_LOG_ERROR("Version was 0, is SPI set up right?");
        return false;
    }
    if (4 != version)
    {
        NRF_LOG_WARNING("Version is %d, expected %d", version, 4);
        // Continue
    }
    NRF_LOG_INFO("CC1101: Self Test Passed. Detected partnum %d, version %d, status 0x%x", partNum, version,
                 CHIPSTATUSBYTE_STATE(m_lastChipStatusByte));
    return true;

}

void cc1101_setIdle(bool flushFifos)
{
    if (statusByteState_idle != CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
    {
        NRF_LOG_DEBUG("Go from state %s to idle", m_statuses[CHIPSTATUSBYTE_STATE(m_lastChipStatusByte)]);
        cc1101_strobe(STROBE_SIDLE); // Tell it to idle
        uint8_t marcState;
        cc1101_readSingleByte(MARCSTATE_REGADDR, &marcState);
        while (marcState_idle != marcState)
        {
            nrf_delay_us(100);
            cc1101_readSingleByte(MARCSTATE_REGADDR, &marcState);
        } // Make sure it goes into idle
    }
    // Now, if flushFifos, send those strobes
    if (flushFifos)
    {
        NRF_LOG_DEBUG("Flushing RX and TX fifos");
        cc1101_strobe(STROBE_FLUSHTXFIFO); // Can flush in idle
        cc1101_strobe(STROBE_FLUSHRXFIFO); // Can flush in idle
    }
//    nrf_delay_us(100);
}

static void setTxPower(int8_t tx_dBm)
{
    uint8_t desiredPaVal;
    if (tx_dBm <= -30)
    {
        m_desiredTxdBm = -30;
        desiredPaVal = 0x03;
        NRF_LOG_INFO("Switching to -30");
    }
    else if (tx_dBm <= -20)
    {
        m_desiredTxdBm = -20;
        desiredPaVal = 0x17;
        NRF_LOG_INFO("Switching to -20");
    }
    else if (tx_dBm <= -15)
    {
        m_desiredTxdBm = -15;
        desiredPaVal = 0x1d;
        NRF_LOG_INFO("Switching to -15");
    }
    else if (tx_dBm <= -10)
    {
        m_desiredTxdBm = -10;
        desiredPaVal = 0x26;
        NRF_LOG_INFO("Switching to -10");
    }
    else if (tx_dBm <= -6)
    {
        m_desiredTxdBm = -6;
        desiredPaVal = 0x37;
        NRF_LOG_INFO("Switching to -6");
    }
    else if (tx_dBm <= 0)
    {
        m_desiredTxdBm = 0;
        desiredPaVal = 0x50;
        NRF_LOG_INFO("Switching to 0");
    }
    else if (tx_dBm <= 5)
    {
        m_desiredTxdBm = 5;
        desiredPaVal = 0x86;
        NRF_LOG_INFO("Switching to 5");
    }
    else if (tx_dBm <= 7)
    {
        m_desiredTxdBm = 7;
        desiredPaVal = 0xcd;
        NRF_LOG_INFO("Switching to 7");
    }
    else if (tx_dBm <= 10)
    {
        m_desiredTxdBm = 10;
        desiredPaVal = 0xc5;
        NRF_LOG_INFO("Switching to 10");
    }
    else
    {
        m_desiredTxdBm = 12;
        desiredPaVal = 0xc0;
        NRF_LOG_INFO("Switching to 12 (max)");
    }
    uint8_t paTableBytes[8] = { 0x00, desiredPaVal, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
    if (cc1101_writeBurst(PATABLE_REGADDR, paTableBytes, 8))
    {
        NRF_LOG_INFO("Set PATABLE");
    }
    else
    {
        NRF_LOG_ERROR("ERROR setting PATABLE");
    }
    m_newTxPower = false;
}

static void setup433PacketTx(void)
{
    if (statusByteState_idle != CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
    {
        cc1101_setIdle(true); // Idle it before writing configs
    }

    /* Rf settings for CC1101, exported Feb 06, 2024
     *432.99MHz, XTAL 26MHz
     */
//    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x06);  //GDO0 Output Pin Configuration
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG1_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG0_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));

    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47); //RX FIFO and TX FIFO Thresholds

    //    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05); //Packet Automation Control
    cc1101_writeSingleByte(PKTCTRL1_REGADDR, PKTCTRL1_APPEND_STATUS | PKTCTRL1_ADDR_CHK(addrChk_none));
#if PKT_SIZE_FIXED
//    regByte | = TODO CRC, maybe whitening
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, PKTCTRL0_LENGTH_CFG(pktCtrl0Len_fixed)); //Packet Automation Control
    cc1101_writeSingleByte(PKTLEN_REGADDR, PKT_LEN);
#else
#error "define"
#endif // #if PKT_SIZE_FIXED
    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06); //Frequency Synthesizer Control
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);   //Frequency Control Word_REGADDR, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xA7);   //Frequency Control Word_REGADDR, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x62);   //Frequency Control Word_REGADDR, Low Byte
    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xF5); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x83); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x33); //Modem Configuration
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x15); //Modem Deviation Setting

    // Added MCSM1 to go automatically from TX to RX when sending.
    uint8_t u8 = MCSM1_CCA_MODE(ccaMode_RssiBelowThresholdUnlessRx);
    u8 |= MCSM1_RXOFF_MODE(rxOff_idle); // Go to Idle when done with RX
    u8 |= MCSM1_TXOFF_MODE(txOff_Rx); // Go to TX when done with RX
    cc1101_writeSingleByte(MCSM1_REGADDR, u8);
    // generated: cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);   //Main Radio Control State Machine Configuration
    // Generated had autocal when idle to RX or TX 0x10, and PO_TIMEOUT of 0b10 (0x08)
    u8 = MCSM0_FS_AUTOCAL(faAutocal_idleToRxOrTx);
    u8 |= MCSM0_PO_TIMEOUT(poTimeout_16counts);
    cc1101_writeSingleByte(MCSM0_REGADDR, u8);   //Main Radio Control State Machine Configuration
    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x14);  //Frequency Offset Compensation Configuration
    cc1101_writeSingleByte(AGCCTRL0_REGADDR, 0x92);  //AGC Control
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB); //Wake On Radio Control
    // Studio wanted FREND0 to 0x11, and in OOK, PATABLE[0] is logic 0, PATABLE[1] is logic 1
    cc1101_writeSingleByte(FREND0_REGADDR, 0x11);  //Front End TX Configuration: PA_PWR[2:0] index in b2:0
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);   //Various Test Settings
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);   //Various Test Settings
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);   //Various Test Settings
//    uint8_t paTableBytes[8] = { 0x00, 0x1D, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }; // 0x1D for -15dBm
//    uint8_t paTableBytes[8] = { 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }; // 0x03 for -30dBm TX power
//    cc1101_writeBurst(PATABLE_REGADDR, paTableBytes, 8);
    setTxPower(-20);

    NRF_LOG_WARNING("CC1101 setup433PacketTx done, TX dBm %d", m_desiredTxdBm);
}

/* Packet sniffer settings Feb 06 2024
 # ---------------------------------------------------
 # Packet sniffer settings for CC1101
 # ---------------------------------------------------
 IOCFG0   |0x0002|0x06|GDO0 Output Pin Configuration
 FIFOTHR  |0x0003|0x47|RX FIFO and TX FIFO Thresholds
 PKTCTRL0 |0x0008|0x05|Packet Automation Control
 FSCTRL1  |0x000B|0x06|Frequency Synthesizer Control
 FREQ2    |0x000D|0x10|Frequency Control Word, High Byte
 FREQ1    |0x000E|0xA7|Frequency Control Word, Middle Byte
 FREQ0    |0x000F|0x62|Frequency Control Word, Low Byte
 MDMCFG4  |0x0010|0xF5|Modem Configuration
 MDMCFG3  |0x0011|0x83|Modem Configuration
 MDMCFG2  |0x0012|0x33|Modem Configuration
 DEVIATN  |0x0015|0x15|Modem Deviation Setting
 MCSM0    |0x0018|0x18|Main Radio Control State Machine Configuration
 FOCCFG   |0x0019|0x14|Frequency Offset Compensation Configuration
 AGCCTRL0 |0x001D|0x92|AGC Control
 WORCTRL  |0x0020|0xFB|Wake On Radio Control
 FREND0   |0x0022|0x11|Front End TX Configuration
 FSCAL3   |0x0023|0xE9|Frequency Synthesizer Calibration
 FSCAL2   |0x0024|0x2A|Frequency Synthesizer Calibration
 FSCAL1   |0x0025|0x00|Frequency Synthesizer Calibration
 FSCAL0   |0x0026|0x1F|Frequency Synthesizer Calibration
 TEST2    |0x002C|0x81|Various Test Settings
 TEST1    |0x002D|0x35|Various Test Settings
 TEST0    |0x002E|0x09|Various Test Settings
 */

//Async TX should work with EV1527SPI to send EV1527 data
/* SmartRF studio set these values:
 *
 {CC1101_IOCFG2,      0x0B},
 {CC1101_IOCFG0,      0x0C},
 {CC1101_FIFOTHR,     0x47},
 {CC1101_PKTCTRL0,    0x12},
 {CC1101_FREQ2,       0x10},
 {CC1101_FREQ1,       0xA7},
 {CC1101_FREQ0,       0x62},
 {CC1101_MDMCFG4,     0x87},
 {CC1101_MDMCFG3,     0x0C},
 {CC1101_MDMCFG2,     0x30},
 {CC1101_MDMCFG1,     0x00},
 {CC1101_FREND0,      0x11},
 {CC1101_FSCAL3,      0xE9},
 {CC1101_FSCAL2,      0x2A},
 {CC1101_FSCAL1,      0x00},
 {CC1101_FSCAL0,      0x1F},
 {CC1101_TEST2,       0x81},
 {CC1101_TEST1,       0x35},
 {CC1101_TEST0,       0x09},

