colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
static void parsePacketAndLQI(int8_t RSSI, uint8_t LQI, bool crcOK, uint8_t* pData, uint32_t len)
{
//    NRF_LOG_INFO("  RX %d-byte packet, RSSI %d, LQI %d, CRC %d.", len, RSSI, LQI, crcOK);
#ifdef UART_TX_PIN
    char strBuf[256];
    int strLen;

//    strLen = snprintf(strBuf, sizeof(strBuf), "%d", RSSI);
//    _4digit7seg_writeStr(strBuf);

//    strLen = snprintf(strBuf, sizeof(strBuf), "RX %d-byte packet, RSSI %d, LQI %d, CRC %d:\n", len, RSSI,
//                      LQI,
//                      crcOK);
//    if (0 < strLen)
//    {
//        uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
//    }
#endif // #ifdef UART_TX_PIN

    if (1 == len)
    {
        NRF_LOG_INFO(" RX 1-byte packet, TX power %d, RSSI %d, LQI %d, CRC %d.", (int8_t )pData[0], len, RSSI, LQI,
                     crcOK);
#ifdef UART_TX_PIN
        strLen = snprintf(strBuf, sizeof(strBuf), " RX 1-byte packet, TX power %d, RSSI %d, LQI %d, CRC %d.\n",
                          (int8_t)pData[0],
                          RSSI, LQI, crcOK);
        if (0 < strLen)
        {
            uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
        }
#endif // #ifdef UART_TX_PIN

    }
    if (2 <= len)
    { // 2nd byte holds the command on command, or ACKer's RSSI of our first command
        int8_t theirTxdBm = (int8_t)pData[0];
        cc1101_setOutputPower(theirTxdBm);
        switch (m_opMode)
        {
            case cc1101_packetRX:
                // If we are the motor driver, we receive the state to set
                globalInts_setMachineState((machineState_t)pData[1]);
                NRF_LOG_INFO(" RX command to mode %d. Sending ack.", (machineState_t )pData[1])
                ;
                NRF_LOG_INFO(" They sent at %d, RSSI %d, LQI %d, CRC %d.", theirTxdBm, RSSI, LQI, crcOK)
                ;
#ifdef UART_TX_PIN
                strLen = snprintf(strBuf, sizeof(strBuf), " RX CMD %d, TX %d dBm, RSSI %d, LQI %d, CRC %d.\n",
                                  pData[1],
                                  (int8_t)pData[0],
                                  RSSI,
                                  LQI, crcOK);
                if (0 < strLen)
                {
                    uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
                }
#endif // #ifdef UART_TX_PIN

                // Send an ACK when we RX a packet
                cc1101_sendPacket((uint8_t)RSSI);
            break;
            case cc1101_packetTX:
                // If we are the remote controller, we receive the RSSI that the driver heard our packet at.

                NRF_LOG_INFO(" RX ACK packet. Receiver heard us at %d.", (int8_t )pData[1])
                ;
                NRF_LOG_INFO(" They sent at %d, RSSI %d, LQI %d, CRC %d.", theirTxdBm, RSSI, LQI, crcOK)
                ;
#ifdef UART_TX_PIN
                strLen = snprintf(strBuf, sizeof(strBuf),
                                  " RX ACK of CMD, received at %d. ACK TX power %d, RSSI %d, LQI %d, CRC %d.\n",
                                  (int8_t)pData[1],
                                  (int8_t)pData[0],
                                  RSSI,
                                  LQI,
                                  crcOK);
                if (0 < strLen)
                {
                    uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
                }
#endif // #ifdef UART_TX_PIN
            break;
            default:
                NRF_LOG_INFO("  RX %d-byte packet, RSSI %d, LQI %d, CRC %d.", len, RSSI, LQI, crcOK)
                ;
            break;
        }

    }
}
static void tryReceivePacket(packetRxSettings_t* pSettings)
{
    uint8_t regByte;
    if (NULL == pSettings)
    {
        NRF_LOG_ERROR("NULL pSettings");
        return;
    }
    if (pSettings->readFromChip)
    {
        readInSettings(pSettings);
    }
    if (pSettings->packetBufIndex == pSettings->expectedPacketLen)
    {
        NRF_LOG_ERROR("Doesn't make sense, resetting receive state");
        pSettings->rxState = packetRxState_awaitingPacketStart;
        pSettings->packetBufIndex = 0;
    }
    // Read RXBYTES to see if there are any bytes
    cc1101_readSingleByte(RXBYTES_REGADDR, &regByte);
    if (regByte & RXBYTES_OVERFLOW)
    {
        NRF_LOG_WARNING("Rx OVERFLOW, flushing and going back to RX!");
        cc1101_strobe(STROBE_FLUSHRXFIFO);
        cc1101_strobe(STROBE_SRX);
        pSettings->rxState = packetRxState_awaitingPacketStart;
        pSettings->packetBufIndex = 0;
        return;
    }
    uint8_t numFifoBytes = RXBYTES_NUM(regByte);
    if (!numFifoBytes)
    { // No bytes to read
//        NRF_LOG_DEBUG("0 RXbytes");
        return;
    }
    // If here, we have bytes to read in RX FIFO
//    NRF_LOG_INFO("have %d bytes in RXFIFO", numFifoBytes);
    switch (pSettings->packetLenCfg)
    {
        case pktCtrl0Len_fixed:
            readPacketBytes(pSettings, numFifoBytes);
        break;
        case pktCtrl0Len_variable:
            NRF_LOG_WARNING("WHY are we in readVariablePacket?")
            ;
            readVariablePacket(pSettings, numFifoBytes);
        break;
        default:
            NRF_LOG_ERROR("Packet type %d not handled yet", pSettings->packetLenCfg)
            ;
        break;
    }
    // Try and parse it
    if (packetRxState_finishedWithPacket == m_rxSettings.rxState)
    {
        if (m_rxSettings.packetBufIndex != m_rxSettings.expectedPacketLen)
        {
            NRF_LOG_WARNING("Something wrong, didn't receive expected bytes, flush and idle");
        }
        else
        { // Parse it, if it looks OK.
            if (m_rxSettings.RSSIandLQIAppended)
            {
                parsePacketAndLQI(m_rxSettings.RSSI, m_rxSettings.LQI, m_rxSettings.CRCok, m_rxSettings.pPacket,
                                  m_rxSettings.packetBufLen);
            }
            else
            {
                NRF_LOG_WARNING("Packet without LQI, TODO parse");
            }

