colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
        }
//        cc1101_setIdle(true);
        m_rxSettings.rxState = packetRxState_awaitingPacketStart;
        m_rxSettings.packetBufIndex = 0;
    }
    else
    { // If not in finished state, check if length is equal, that would be an error
        if (m_rxSettings.packetBufIndex >= m_rxSettings.expectedPacketLen)
        {
            NRF_LOG_WARNING("Received %d of %d bytes, but state still %d, reset parser",
                            m_rxSettings.packetBufIndex,
                            m_rxSettings.expectedPacketLen,
                            m_rxSettings.rxState);
            // reset parser state
            m_rxSettings.rxState = packetRxState_awaitingPacketStart;
            m_rxSettings.packetBufIndex = 0;
        }
        else
        {
            // Keep waiting for packet, TODO timeout?
        }
    }
}

static void asyncTxPoll(chipStatusByteState_t currentState)
{
    switch (currentState)
    {
        case statusByteState_tx:
            // Gets into this state from someone telling it to send a packet.
            if (statusByteState_tx != m_lastReadStatusByteState)
            {
                NRF_LOG_INFO("Went into TX state, good");
            }
        break;
        case statusByteState_rx:
            NRF_LOG_ERROR("Should not be in RX, idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_idle:
            // should not be in idle, go to TX state
            NRF_LOG_ERROR("Should NOT be in idle state, goto TX")
            ;
            cc1101_strobe(STROBE_STX);
        break;
        case statusByteState_rxOverflow:
            NRF_LOG_ERROR("Detected RX overflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_txUnderflow:
            NRF_LOG_ERROR("Detected TX underflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        default:
            //ignore for now
        break;
    }
}

static void packetRxPoll(chipStatusByteState_t currentState)
{
    switch (currentState)
    {
        case statusByteState_tx:
            if (1 == m_sendState)
            {
                // Gets into this state from someone telling it to send a packet.
                if (m_inState_ms >= TX_TIMEOUT_MS)
                { // Shouldn't take a long time to send
                    m_sendState = 0;
                    NRF_LOG_ERROR("Timed out in TX state, idling")
                    ;
                    cc1101_setIdle(true);
                }
            }
            else
            {
                NRF_LOG_ERROR("In TX state, should NOT be here, idling.")
                ;
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_rx:
            // If in receiving state
            if (0 == m_inState_ms)
            { // Reset RX parser on entry, then try and receive packet
                m_rxSettings.rxState = packetRxState_awaitingPacketStart;
                m_rxSettings.packetBufIndex = 0;
            }
            if (m_inState_ms >= 5000)
            { // It should transition to IDLE when done receiving a packet
                NRF_LOG_WARNING("Timed out in RX state, idling")
                ;
#ifdef UART_TX_PIN
                uartTerminal_enqueueToUSB((uint8_t*)"Timed out in RX, idling\n",
                                          strlen("Timed out in RX, idling\n"));
#endif // #ifdef UART_TX_PIN
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_idle:
            // Usually here because we received a packet, or because we errored and came here
            //            NRF_LOG_DEBUG("Idle Check for Received")
            //            ;
            // In RX mode, switch to RX state ASAP
            if (m_newTxPower)
            {
                setTxPower(m_desiredTxdBm);
                m_newTxPower = false;
            }
            if (0 == m_inState_ms)
            { // Reset RX parser on entry, then try and receive packet
                m_rxSettings.rxState = packetRxState_awaitingPacketStart;
                m_rxSettings.packetBufIndex = 0;
            }
            m_sendState = 0;
            // Check if we have received a packet
            tryReceivePacket(&m_rxSettings);

            if (1 == m_sendState)
            {
//                NRF_LOG_INFO("sendState 1, it should go to TX");
                cc1101_strobe(STROBE_NOP);
                NRF_LOG_INFO("is it in TX?");
            }
            else
            {
                NRF_LOG_DEBUG("poller start RX:")
                ;
                cc1101_strobe(STROBE_FLUSHRXFIFO); // Can flush in idle
                cc1101_strobe(STROBE_FLUSHTXFIFO); // Can flush in idle
                cc1101_strobe(STROBE_SRX);
            }
        break;
        case statusByteState_rxOverflow:
            NRF_LOG_ERROR("Detected RX overflow,idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_txUnderflow:
            NRF_LOG_ERROR("Detected TX underflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        default:
            if (m_inState_ms > 1000)
            {
                NRF_LOG_WARNING("State 0x%x, idling", CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
                ;
                cc1101_setIdle(true);
            }
        break;
    }
}

static void packetTxPoll(chipStatusByteState_t currentState)
{
    switch (currentState)
    {
        case statusByteState_tx:
            // Gets into this state from someone telling it to send a packet.
            if (m_inState_ms >= TX_TIMEOUT_MS)
            { // Shouldn't take a long time to send, TODO find time
                NRF_LOG_ERROR("Timed out in TX state, idling")
                ;
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_rx:
            if ((m_sendState && (RX_AFTER_TX_TIMEOUT_MS < m_inState_ms))
                    || (0 == m_sendState))
            {
                NRF_LOG_ERROR("packetTx should not be in RX state, sendState %d, in for %d ms, idling", m_sendState,
                              m_inState_ms)
                ;
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_idle:
            // Idle until someone calls sendPacket
            if (m_newTxPower)
            {
                setTxPower(m_desiredTxdBm);
                m_newTxPower = false;
            }
            if (0 == m_inState_ms)
            { // Reset RX parser on entry, then try and receive packet
                m_rxSettings.rxState = packetRxState_awaitingPacketStart;
                m_rxSettings.packetBufIndex = 0;
                // Usually here because we received a packet
                tryReceivePacket(&m_rxSettings);
            }
            // Stay in idle until next TX command triggers TX, then TX to RX, then idle again.
        break;
        case statusByteState_rxOverflow:
            NRF_LOG_ERROR("Detected RX overflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_txUnderflow:
            NRF_LOG_ERROR("Detected TX underflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        default:
            if (m_inState_ms > 1000)
            {
                NRF_LOG_WARNING("State 0x%x, idling", CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
                ;
                cc1101_setIdle(true);
            }
        break;
    }
}

