colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
static void cc1101Poll(void)
{
    if (uptimeCounter_elapsedSince(m_lastPoll_ms) < STATUS_POLL_ITVL_MS)
    { // Don't spam SPI bus, especially when RXing
        return;
    }
// If here, we have expired the timer and can ask it what's up.
    cc1101_strobe(STROBE_NOP); // Strobe NOP to get status
// See if state has changed
    chipStatusByteState_t currentState = CHIPSTATUSBYTE_STATE(m_lastChipStatusByte);
    if (currentState != m_lastReadStatusByteState)
    {
        m_inState_ms = 0;
    }
    else
    { // If in state, increment timer
        m_inState_ms += uptimeCounter_elapsedSince(m_lastPoll_ms);
    }
    switch (m_opMode)
    {
        case cc1101_asyncTX:
            asyncTxPoll(currentState);
        break;
        case cc1101_packetRX:
            packetRxPoll(currentState);
        break;
        case cc1101_packetTX:
            packetTxPoll(currentState);
        break;
        default:
            break;
    }

#if TX_TEST_ITVL_MS
if (uptimeCounter_elapsedSince(m_lastTx_ms) >= TX_TEST_ITVL_MS)
{
    // TODO run a TX packet
    uint8_t txPacketBytes[PKT_LEN];
    for (uint8_t i = 0; i < PKT_LEN; i++)
    {
        txPacketBytes[i] = i;
    }
    cc1101_sendPacket(txPacketBytes, PKT_LEN);
    m_lastTx_ms = uptimeCounter_getUptimeMs();
}
#endif // #if TX_TEST_ITVL_MS

    m_lastReadStatusByteState = currentState;
    m_lastPoll_ms = uptimeCounter_getUptimeMs();

}

//bool cc1101_sendPacket(uint8_t* pBytes, uint8_t len)
//{
//    if (len > PKT_LEN)
//    {
//        NRF_LOG_ERROR("Can only send %d bytes per packet, not %d, ignoring", PKT_LEN, len);
//        return false;
//    }
//    uint8_t pktBuf[PKT_LEN];
//    for (uint8_t i = 0; i < PKT_LEN; i++)
//    {
//        if (i < len)
//        {
//            pktBuf[i] = pBytes[i];
//        }
//        else
//        {
//            pktBuf[i] = 0xFF;
//        }
//    }
//    bool ret = true;
//    ret &= cc1101_writeBurst(TXFIFO_REGADDR, pktBuf, PKT_LEN);
//    uint8_t regData;
//    ret &= cc1101_readSingleByte(TXBYTES_REGADDR, &regData);
//    NRF_LOG_DEBUG("Wanted to send %d bytes, sent packet of %d bytes to txfifo, TXYBTES says %d", len, PKT_LEN,
//                  regData);
//    ret &= cc1101_strobe(STROBE_STX);
//    return ret;
//}

bool cc1101_sendPacket(uint8_t byte)
{
    uint8_t pktBuf[PKT_LEN];
    pktBuf[0] = (uint8_t)m_desiredTxdBm;
    pktBuf[1] = byte;
    bool ret = true;
    ret &= cc1101_writeBurst(TXFIFO_REGADDR, pktBuf, PKT_LEN);
    ret &= cc1101_readSingleByte(TXBYTES_REGADDR, pktBuf);
    if (PKT_LEN == pktBuf[0])
    {
#if verbose_tx
        NRF_LOG_DEBUG("Sending packet of %d bytes at %d dBm.", PKT_LEN, m_desiredTxdBm);
#ifdef UART_TX_PIN
        uint8_t strBytes[256];
        int printlen = snprintf((char*)strBytes, sizeof(strBytes), "CC1101 sending %d bytes at %d dBm\n", PKT_LEN,
                                m_desiredTxdBm);
        if (0 < printlen)
        {
            uartTerminal_enqueueToUSB(strBytes, (uint32_t)printlen);
        }
#endif // #ifdef UART_TX_PIN
#endif // #if verbose_tx
    }
    else
    {
        NRF_LOG_WARNING("Sending packet of %d bytes at %d dBm to txfifo, BUT TXYBTES says %d", PKT_LEN,
                        m_desiredTxdBm,
                        pktBuf[0]);
    }
    ret &= cc1101_strobe(STROBE_STX);
    m_sendState++;
    return ret;

}

cc1101Mode_t cc1101_readMode(void)
{
    return m_opMode;
}

void cc1101_setOutputPower(int8_t power_dBm)
{
    m_desiredTxdBm = power_dBm;
    m_newTxPower = true;
}

void cc1101_init(cc1101Mode_t desired)
{
    spi0_init(); // Make sure pins are muxed and working
    m_lastChipStatusByte = 0xFF;
    bool testPass = cc1101_reboot();
    if (!testPass)
    {
        NRF_LOG_ERROR("Couldn't reboot CC1101");
        return;
    }
    testPass = cc1101_selfTest();
    if (!testPass)
    {
        NRF_LOG_ERROR("CC1101 self-test failed");
        return;
    }
// If here, init it
//    cc1101_initASKTx_myStudio();
    m_opMode = cc1101_unknownMode;

    ev1527SPI_turnOff(SPI2_MOSI_PIN); // Default to off.

    switch (desired)
    {
        case cc1101_packetRX:
            initPacketReceiver();
            setup433PacketTx(); // Same settings for Rx side
            m_opMode = cc1101_packetRX;
        break;
        case cc1101_packetTX:
            initPacketReceiver();
            setup433PacketTx();
            m_opMode = cc1101_packetTX;
            m_sendState = 0;
        break;
        case cc1101_asyncTX:
            // do NOT set up the MOSI pin to drive yet, until we de-init the default CC1101 drive as output.
            setupAsyncTx();
            // Now set up our output pin, which should idle low to not send.
            ev1527SPI_init(SPI2_MOSI_PIN); // init SPI, which idles low.
            cc1101_strobe(STROBE_STX); // Start TX of CC1101, to send what comes out MOSI
            m_opMode = cc1101_asyncTX;
            NRF_LOG_WARNING("Be sure to wire SPI2_MOSI pin %d to CC1101 GDO0", SPI2_MOSI_PIN)
            ;
        break;
        default:
            NRF_LOG_ERROR("Don't know how to set  up mode %d\n", desired)
            ;
        break;
    }

    pollers_registerPoller(cc1101Poll);
}

